In [1]:
import pandas as pd

In [3]:
pp = pd.read_csv('/home/admin1/Downloads/Datasets/titanic_data.csv')

In [4]:
pp.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [5]:
missing_values = pp.isnull().sum()

In [6]:
print(missing_values)

survived         0
pclass           0
sex              0
age            176
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           686
embark_town      2
alive            0
alone            0
dtype: int64

In [7]:
pp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 889 entries, 0 to 888
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     889 non-null    int64
 1   pclass       889 non-null    int64
 2   sex          889 non-null    object
 3   age          713 non-null    float64
 4   sibsp        889 non-null    int64
 5   parch        889 non-null    int64
 6   fare         889 non-null    float64
 7   embarked     887 non-null    object
 8   class        889 non-null    object
 9   who          889 non-null    object
 10  adult_male   889 non-null    bool
 11  deck         203 non-null    object
 12  embark_town  887 non-null    object
 13  alive        889 non-null    object
 14  alone        889 non-null    bool
dtypes: bool(2), float64(2), int64(4), object(7)
memory usage: 92.2+ KB

In [6]:
missing_values = titanic.isnull().sum()

In [7]:
print(missing_values)

survived         0
pclass           0
sex              0
age            176
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           686
embark_town      2
alive            0
alone            0
dtype: int64

In [8]:
data_description = titanic.describe()

In [9]:
print(data_description)

         survived      pclass         age       sibsp       parch        fare
count  889.000000  889.000000  713.000000  889.000000  889.000000  889.000000
mean     0.384702    2.307087   29.698696    0.523060    0.382452   32.259059
std      0.486799    0.836367   14.536691    1.103729    0.806761   49.735870
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.000000    0.000000    0.000000    7.925000
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [10]:
variable_descriptions = titanic.dtypes

In [12]:
print(variable_descriptions)

survived         int64
pclass           int64
sex             object
age            float64
sibsp            int64
parch            int64
fare           float64
embarked        object
class           object
who             object
adult_male        bool
deck            object
embark_town     object
alive           object
alone             bool
dtype: object

In [13]:
data_dimensions = titanic.shape

In [14]:
print(data_dimensions)

(889, 15)

In [15]:
variable_types_before_conversion = titanic.dtypes

In [16]:
titanic['age'] = pd.to_numeric(titanic['age'], errors='coerce')

In [17]:
titanic['sex'] = pd.Categorical(titanic['sex']).codes

In [18]:
print(variable_types_before_conversion)

survived         int64
pclass           int64
sex             object
age            float64
sibsp            int64
parch            int64
fare           float64
embarked        object
class           object
who             object
adult_male        bool
deck            object
embark_town     object
alive           object
alone             bool
dtype: object

In [19]:
print("\nDataFrame after Type Conversion:\n", titanic.sample(5))

DataFrame after Type Conversion:
      survived  pclass  sex   age  sibsp  parch     fare embarked  class  \
110         0       1    1  47.0      0      0  52.0000        S  First
187         1       1    1  45.0      0      0  26.5500        S  First
661         0       3    1  36.0      0      0   7.4958        S  Third
277         0       3    1   7.0      4      1  29.1250        Q  Third
699         1       1    1  35.0      0      0  26.2875        S  First

       who  adult_male deck  embark_town alive  alone
110    man        True    C  Southampton    no   True
187    man        True  NaN  Southampton   yes   True
661    man        True  NaN  Southampton    no   True
277  child       False  NaN   Queenstown    no  False
699    man        True    E  Southampton   yes   True